[Killed] ObjectLiteral
main/components/Commons/PagedProfitsTable.js:89:21
 
 
     return (
-        <div style={{ display: "inline-block"}} data-testid={`${testId}-style-inline`}>
+        <div style={{}} data-testid={`${testId}-style-inline`}>
             <p>Page: {selectedPage + 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
killedBy: PagedProfitsTable tests renders table with correct layout
statusReason: Error: expect(element).toHaveStyle()

- Expected

- display: inline-block;
+ display: block;

<html>

[Killed] ArithmeticOperator
main/components/Commons/PagedProfitsTable.js:90:23
 
     return (
         <div style={{ display: "inline-block"}} data-testid={`${testId}-style-inline`}>
-            <p>Page: {selectedPage + 1}</p>
+            <p>Page: {selectedPage - 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
             <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
killedBy: PagedProfitsTable tests renders correct content with multiple pages
statusReason: TestingLibraryElementError: Unable to find an element with the text: Page: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="PagedProfitsTable-style-inline"
      style="display: inline-block;"
    >
