[Killed] BlockStatement
main/components/Students/StudentsTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/Students/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: StudentsTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/Students/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Students/StudentsTable.js:37:23
         },
         {
             Header: 'Perm',
-            accessor: 'perm',
+            accessor: "",
         },
         {
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-perm"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Students/StudentsTable.js:41:23
         },
         {
             Header: 'Last Name',
-            accessor: 'lName',
+            accessor: "",
         },
         {
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-lName"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Students/StudentsTable.js:45:23
         },
         {
             Header: 'First and Middle Name',
-            accessor: 'fmName',
+            accessor: "",
         },
         {
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-fmName"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Students/StudentsTable.js:48:21
             accessor: 'fmName',
         },
         {
-            Header: 'Course Id',
+            Header: "",
             accessor: 'courseId',
         },
killedBy: StudentsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] BlockStatement
main/components/Students/StudentsTable.js:57:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "StudentsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StudentsTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Students/StudentsTable.js:58:68
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "StudentsTable"));
+        columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StudentsTable"));
     } 
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Students/StudentsTable.js:58:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "StudentsTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "StudentsTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StudentsTable"));
     } 
killedBy: StudentsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Students/StudentsTable.js:65:17
     return <OurTable
         data={students}
         columns={columns}
-        testid={"StudentsTable"}
+        testid={""}
     />;
 };
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      role="table"
    >
      <table
