[Killed] BlockStatement
src/main/pages/StudentsIndexPage.js:3:45
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function StudentsIndexPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p>
-          <a href="/admin/Students/create">Create</a>
-        </p>
-        <p>
-          <a href="/admin/Students/edit/1">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function StudentsIndexPage() {}
 
killedBy: StudentsIndexPage tests Renders expected content
statusReason: Error: StudentsIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
