[Killed] StringLiteral
main/components/Students/StudentsForm.js:5:70
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom'
 
-function StudentsForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function StudentsForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: StudentsForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Students/StudentsForm.js:19:26
 
     const navigate = useNavigate();
 
-    const testIdPrefix = "StudentsForm";
+    const testIdPrefix = "";
 
     // For explanation, see: https://stackoverflow.com/questions/3143070/javascript-regex-iso-datetime
killedBy: StudentsForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="StudentsForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Students/StudentsForm.js:27:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
             <Row>
-                {initialContents && (
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="id">Id</Form.Label>
-                        <Form.Control
-                            // Stryker disable next-line all
-                            data-testid={testIdPrefix + "-id"}
-                            id="id"
-                            type="text"
-                            {...register("id")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-                )}
+                {initialContents || <Form.Group className="mb-3">
+                        <Form.Label htmlFor="id">Id</Form.Label>
+                        <Form.Control
+  // Stryker disable next-line all
+  data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                    </Form.Group>}
 
                 <Col>
killedBy: StudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Students/StudentsForm.js:27:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
             <Row>
-                {initialContents && (
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="id">Id</Form.Label>
-                        <Form.Control
-                            // Stryker disable next-line all
-                            data-testid={testIdPrefix + "-id"}
-                            id="id"
-                            type="text"
-                            {...register("id")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-                )}
+                {true}
 
                 <Col>
killedBy: StudentsForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="StudentsForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Students/StudentsForm.js:56:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.perm?.message}
+                            {errors.perm.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: StudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Students/StudentsForm.js:70:42
                             id="lName"
                             type="text"
                             isInvalid={Boolean(errors.lName)}
-                            {...register("lName", {
+                            {...register("", {
                                 required: "The last name is required",
                             })}
killedBy: StudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Students/StudentsForm.js:71:43
                             type="text"
                             isInvalid={Boolean(errors.lName)}
                             {...register("lName", {
-                                required: "The last name is required",
+                                required: "",
                             })}
                         />
killedBy: StudentsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /The last name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Students/StudentsForm.js:75:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.lName?.message}
+                            {errors.lName.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: StudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/Students/StudentsForm.js:94:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.fmName?.message}
+                            {errors.fmName.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: StudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/Students/StudentsForm.js:108:51
                             id="email"
                             type="text"
                             isInvalid={Boolean(errors.email)}
-                            {...register("email", {
-                                required: "The email is required",
-                            })}
+                            {...register("email", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: StudentsForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /The email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Students/StudentsForm.js:109:43
                             type="text"
                             isInvalid={Boolean(errors.email)}
                             {...register("email", {
-                                required: "The email is required",
+                                required: "",
                             })}
                         />
killedBy: StudentsForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /The email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Students/StudentsForm.js:127:42
                             id="courseId"
                             type="text"
                             isInvalid={Boolean(errors.courseId)}
-                            {...register("courseId", {
+                            {...register("", {
                                 required: "The Course Id is required",
                             })}
killedBy: StudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Students/StudentsForm.js:132:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.courseId?.message}
+                            {errors.courseId.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: StudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
