[Killed] BlockStatement
main/components/Students/StudentsTable.js:11:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/admin/Students/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: StudentsTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/Students/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Students/StudentsTable.js:34:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: 'Perm',
+            Header: "",
             accessor: 'perm',
         },
killedBy: StudentsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Perm. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ObjectLiteral
main/components/Students/StudentsTable.js:37:9
             Header: 'Perm',
             accessor: 'perm',
         },
-        {
-            Header: 'Last Name',
-            accessor: 'lName',
-        },
+        {},
         {
             Header: 'First and Middle Name',
killedBy: StudentsIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Students/StudentsTable.js:41:9
             Header: 'Last Name',
             accessor: 'lName',
         },
-        {
-            Header: 'First and Middle Name',
-            accessor: 'fmName',
-        },
+        {},
         {
             Header: 'Course Id',
killedBy: StudentsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Students/StudentsTable.js:47:23
         },
         {
             Header: 'Course Id',
-            accessor: 'courseId',
+            accessor: "",
         },
         {
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Students/StudentsTable.js:56:67
     ];
 
     columns.push(ButtonColumn("Edit", "primary", editCallback, "StudentsTable"));
-    columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StudentsTable"));
+    columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
 
     return <OurTable
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Students/StudentsTable.js:56:41
     ];
 
     columns.push(ButtonColumn("Edit", "primary", editCallback, "StudentsTable"));
-    columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StudentsTable"));
+    columns.push(ButtonColumn("Delete", "", deleteCallback, "StudentsTable"));
 
     return <OurTable
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
