[Killed] BlockStatement
src/main/pages/StudentsCreatePage.js:3:46
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function StudentsCreatePage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function StudentsCreatePage() {}
 
killedBy: StudentsCreatePage tests Renders expected content
statusReason: Error: StudentsCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
