[Killed] BlockStatement
src/main/pages/StudentsEditPage.js:3:44
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function StudentsEditPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function StudentsEditPage() {}
 
killedBy: StudentsEditPage tests Renders expected content
statusReason: Error: StudentsEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
