[Killed] StringLiteral
main/components/Students/StudentsEditForm.js:71:43
                             type="text"
                             isInvalid={Boolean(errors.lastName)}
                             {...register("lastName", {
-                                required: "The last name of the student is required.",
+                                required: "",
                             })}
                         />
killedBy: StudentsEditForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /The last name of the student is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Students/StudentsEditForm.js:89:42
                             id="firstMiddleName"
                             type="text"
                             isInvalid={Boolean(errors.firstMiddleName)}
-                            {...register("firstMiddleName", {
+                            {...register("", {
                                 required: "The first and middle names of the student are required.",
                             })}
killedBy: StudentsEditPage tests tests where backend is working normally renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Students/StudentsEditForm.js:89:61
                             id="firstMiddleName"
                             type="text"
                             isInvalid={Boolean(errors.firstMiddleName)}
-                            {...register("firstMiddleName", {
-                                required: "The first and middle names of the student are required.",
-                            })}
+                            {...register("firstMiddleName", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: StudentsEditForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /The first and middle names of the student are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Students/StudentsEditForm.js:90:43
                             type="text"
                             isInvalid={Boolean(errors.firstMiddleName)}
                             {...register("firstMiddleName", {
-                                required: "The first and middle names of the student are required.",
+                                required: "",
                             })}
                         />
killedBy: StudentsEditForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /The first and middle names of the student are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Students/StudentsEditForm.js:94:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.firstMiddleName?.message}
+                            {errors.firstMiddleName.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: StudentsEditPage tests tests where backend is working normally renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/Students/StudentsEditForm.js:108:51
                             id="email"
                             type="text"
                             isInvalid={Boolean(errors.email)}
-                            {...register("email", {
-                                required: "The email of the student is required.",
-                            })}
+                            {...register("email", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: StudentsEditForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /The email of the student is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
