[Killed] StringLiteral
main/components/Students/StudentsForm.js:109:43
                             type="text"
                             isInvalid={Boolean(errors.email)}
                             {...register("email", {
-                                required: "The email of the student is required.",
+                                required: "",
                             })}
                         />
killedBy: StudentsForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /The email of the student is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
