[Killed] StringLiteral
main/components/Students/StudentsTable.js:13:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/admin/Students/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: StudentsTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/Students/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Students/StudentsTable.js:40:23
         },
         {
             Header: 'Last Name',
-            accessor: 'lastName',
+            accessor: "",
         },
         {
killedBy: StudentsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-lastName"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ObjectLiteral
main/components/Students/StudentsTable.js:42:9
             Header: 'Last Name',
             accessor: 'lastName',
         },
-        {
-            Header: 'First and Middle Name',
-            accessor: 'firstMiddleName',
-        },
+        {},
         {
             Header: 'Course Id',
killedBy: StudentsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Students/StudentsTable.js:43:21
             accessor: 'lastName',
         },
         {
-            Header: 'First and Middle Name',
+            Header: "",
             accessor: 'firstMiddleName',
         },
killedBy: StudentsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: First and Middle Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Students/StudentsTable.js:55:35
             accessor: 'email',
         }
     ];
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "StudentsTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "StudentsTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StudentsTable"));
 
killedBy: StudentsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Students/StudentsTable.js:56:35
         }
     ];
         columns.push(ButtonColumn("Edit", "primary", editCallback, "StudentsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StudentsTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "StudentsTable"));
 
     return <OurTable
killedBy: StudentsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
