[Killed] BooleanLiteral
src/main/pages/StudentsEditPage.js:8:56
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function StudentsEditPage({ storybook = false }) {
+export default function StudentsEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: StudentsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/admin/Students"}

Number of calls: 0

[Killed] StringLiteral
src/main/pages/StudentsEditPage.js:19:12
     {
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/Students`,
+      url: ``,
       params: {
         id,
killedBy: StudentsEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="StudentsEditForm-lastName"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/StudentsEditPage.js:26:34
     },
   );
 
-  const objectToAxiosPutParams = (students) => ({
-    url: "/api/Students",
-    method: "PUT",
-    params: {
-      id: students.id,
-    },
-    data: {
-      perm: students.perm,
-      lastName: students.lastName,
-      firstMiddleName: students.firstMiddleName,
-      courseId: students.courseId,
-      email: students.email,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (students) => {
killedBy: StudentsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/StudentsEditPage.js:28:13
 
   const objectToAxiosPutParams = (students) => ({
     url: "/api/Students",
-    method: "PUT",
+    method: "",
     params: {
       id: students.id,
killedBy: StudentsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/StudentsEditPage.js:41:35
     },
   });
 
-  const onSuccess = (students) => {
-    toast(
-      `Student Updated - id: ${students.id}`,
-    );
-  };
+  const onSuccess = (students) => {};
 
   const mutation = useBackendMutation(
killedBy: StudentsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/StudentsEditPage.js:60:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/admin/Students" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: StudentsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/admin/Students"}

Number of calls: 0

[Killed] ConditionalExpression
src/main/pages/StudentsEditPage.js:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Student</h1>
-        {students && (
-          <StudentsEditForm
-            initialContents={students}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: StudentsEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="StudentsEditForm-lastName"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
src/main/pages/StudentsEditPage.js:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Student</h1>
-        {students && (
-          <StudentsEditForm
-            initialContents={students}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {students || <StudentsEditForm initialContents={students} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: StudentsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm, lastName, firstMiddleName, courseId, email}). If you meant to render a collection of children, use an array instead.
