[Killed] BooleanLiteral
src/main/pages/StudentsCreatePage.js:7:58
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function StudentsCreatePage({ storybook = false }) {
+export default function StudentsCreatePage({ storybook = true }) {
   const objectToAxiosParams = (students) => ({
     url: "/api/Students/post",
killedBy: StudentsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/admin/Students"}

Number of calls: 0

[Killed] ArrowFunction
src/main/pages/StudentsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function StudentsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (students) => ({
-    url: "/api/Students/post",
-    method: "POST",
-    params: {
-      perm: students.perm,
-      lastName: students.lastName,
-      firstMiddleName: students.firstMiddleName,
-      courseId: students.courseId,
-      email: students.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (students) => {
killedBy: StudentsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/StudentsCreatePage.js:20:35
     },
   });
 
-  const onSuccess = (students) => {
-    toast(
-      `New Student Created - id: ${students.id}`,
-    );
-  };
+  const onSuccess = (students) => {};
 
   const mutation = useBackendMutation(
killedBy: StudentsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Student Created - id: 1"

Number of calls: 0
